In [64]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as ply
import seaborn as sns
from sklearn.model_selection import train_test_split
from sklearn.tree import DecisionTreeClassifier
from sklearn.metrics import accuracy_score
from sklearn.neighbors import KNeighborsClassifier

In [79]:
train=pd.read_csv('train.csv')
test=pd.read_csv('test.csv')

In [80]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [81]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [82]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

# Fill 'Embarked' column

In [83]:
train[train['Embarked'].isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN

In [84]:
Pclass_group = train.groupby('Pclass')
Pclass_group.get_group(1)['Fare'].mean()

84.15468749999992

In [85]:
train['Embarked'].fillna('S', inplace=True)

In [86]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [87]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Add 'family' column and drop 'SibSp' & 'Parch' column

In [88]:
train['family'] = train['SibSp'] + train['Parch']
train.drop(columns=['SibSp', 'Parch'], inplace = True)

In [89]:
test['family'] = test['SibSp'] + test['Parch']
test.drop(columns=['SibSp', 'Parch'], inplace = True)

In [90]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,Ticket,Fare,Cabin,Embarked,family
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,NaN,S,0

In [91]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,Ticket,Fare,Cabin,Embarked,family
0,892,3,"Kelly, Mr. James",male,34.5,330911,7.8292,NaN,Q,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,363272,7.0000,NaN,S,1
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,240276,9.6875,NaN,Q,0
3,895,3,"Wirz, Mr. Albert",male,27.0,315154,8.6625,NaN,S,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,3101298,12.2875,NaN,S,2

# Fill the 'Age' column

In [92]:
train['Age'].fillna(train.groupby(['Sex','Pclass']).transform('mean')['Age'], inplace=True)
test['Age'].fillna(test.groupby(['Sex','Pclass']).transform('mean')['Age'], inplace=True)

In [93]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   Ticket       891 non-null    object
 7   Fare         891 non-null    float64
 8   Cabin        204 non-null    object
 9   Embarked     891 non-null    object
 10  family       891 non-null    int64
dtypes: float64(2), int64(4), object(5)
memory usage: 76.7+ KB

In [94]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          418 non-null    float64
 5   Ticket       418 non-null    object
 6   Fare         417 non-null    float64
 7   Cabin        91 non-null     object
 8   Embarked     418 non-null    object
 9   family       418 non-null    int64
dtypes: float64(2), int64(3), object(5)
memory usage: 32.8+ KB

# fill cabin column

In [95]:
train.drop(columns=['Cabin'], inplace = True)
test.drop(columns=['Cabin'], inplace = True)

In [18]:
train['Cabin'].fillna(0,inplace=True)
test['Cabin'].fillna(0,inplace=True)

In [19]:
def transform_cabin(cabin):
    if cabin!=0:
        return 1
    else:
        return 0
    
train['Cabin']=train['Cabin'].apply(transform_cabin)
test['Cabin']=test['Cabin'].apply(transform_cabin)

In [96]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   Ticket       891 non-null    object
 7   Fare         891 non-null    float64
 8   Embarked     891 non-null    object
 9   family       891 non-null    int64
dtypes: float64(2), int64(4), object(4)
memory usage: 69.7+ KB

In [97]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          418 non-null    float64
 5   Ticket       418 non-null    object
 6   Fare         417 non-null    float64
 7   Embarked     418 non-null    object
 8   family       418 non-null    int64
dtypes: float64(2), int64(3), object(4)
memory usage: 29.5+ KB

# Fare missing value in test dataframe

In [98]:
test[test['Fare'].isnull()]

,PassengerId,Pclass,Name,Sex,Age,Ticket,Fare,Embarked,family
152,1044,3,"Storey, Mr. Thomas",male,60.5,3701,NaN,S,0

In [101]:
test_fare = test.groupby(['Pclass', 'Embarked'])
test_fare.get_group((3, 'S')).mean()['Fare']

13.91302978723404

In [102]:
test.fillna(test_fare.get_group((3, 'S')).mean()['Fare'], inplace = True)

In [103]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          418 non-null    float64
 5   Ticket       418 non-null    object
 6   Fare         418 non-null    float64
 7   Embarked     418 non-null    object
 8   family       418 non-null    int64
dtypes: float64(2), int64(3), object(4)
memory usage: 29.5+ KB

# After filling data, then modifing

In [104]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,Ticket,Fare,Embarked,family
0,892,3,"Kelly, Mr. James",male,34.5,330911,7.8292,Q,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,363272,7.0000,S,1
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,240276,9.6875,Q,0
3,895,3,"Wirz, Mr. Albert",male,27.0,315154,8.6625,S,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,3101298,12.2875,S,2

In [105]:
PassengerId = test.iloc[:,0]

In [106]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,Ticket,Fare,Embarked,family
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,S,0

In [107]:
train.drop(columns=['PassengerId', 'Name', 'Ticket','Fare', 'Embarked'], inplace = True)
test.drop(columns=['PassengerId', 'Name', 'Ticket', 'Fare','Embarked'], inplace = True)

In [109]:
train=pd.get_dummies(train, columns=['Pclass', 'Sex',], drop_first=True)
test=pd.get_dummies(test, columns=['Pclass', 'Sex',], drop_first=True)

In [110]:
train.head()

   Survived   Age  family  Pclass_2  Pclass_3  Sex_male
0         0  22.0       1         0         1         1
1         1  38.0       1         0         0         0
2         1  26.0       0         0         1         0
3         1  35.0       1         0         0         0
4         0  35.0       0         0         1         1

# Training Model

In [111]:
X = train.iloc[:, 1:].values
y = train.iloc[:,0].values

In [1301]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.20)

In [1302]:
clf = DecisionTreeClassifier()

In [1303]:
for i in range(1,50):
    clf = DecisionTreeClassifier(max_depth=i)
    clf.fit(X_train, y_train)
    y_pred = clf.predict(X_test)
    print(accuracy_score(y_test, y_pred))

0.7653631284916201
0.776536312849162
0.7932960893854749
0.7932960893854749
0.776536312849162
0.7821229050279329
0.7541899441340782
0.7653631284916201
0.7541899441340782
0.7430167597765364
0.7430167597765364
0.7262569832402235
0.7262569832402235
0.7206703910614525
0.7150837988826816
0.7206703910614525
0.7150837988826816
0.7262569832402235
0.7262569832402235
0.7206703910614525
0.7262569832402235
0.7206703910614525
0.7262569832402235
0.7262569832402235
0.7206703910614525
0.7150837988826816
0.7206703910614525
0.7262569832402235
0.7150837988826816
0.7206703910614525
0.7150837988826816
0.7150837988826816
0.7206703910614525
0.7206703910614525
0.7206703910614525
0.7262569832402235
0.7262569832402235
0.7206703910614525
0.7206703910614525
0.7206703910614525
0.7150837988826816
0.7206703910614525
0.7206703910614525
0.7150837988826816
0.7262569832402235
0.7206703910614525
0.7206703910614525
0.7150837988826816
0.7206703910614525

In [1111]:
test.head()

    Age  family  Pclass_2  Pclass_3  Sex_male
0  34.5       0         0         1         1
1  47.0       1         0         1         0
2  62.0       0         1         0         1
3  27.0       0         0         1         1
4  22.0       2         0         1         0

In [1098]:
X_final = test.iloc[:,:].values

In [840]:
clf = DecisionTreeClassifier(max_depth = 5)
clf.fit(X_train, y_train)
y_final = clf.predict(X_final)

In [841]:
y_final.shape

(418,)

In [842]:
PassengerId.shape

(418,)

In [843]:
new = pd.DataFrame()
new['passengerId']=PassengerId
new['Survived']=y_final

In [844]:
new.head()

   passengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         1

In [845]:
new.shape

(418, 2)

In [846]:
new.to_csv('89.237_test_0.25_withoutFare_Embarkedsubmission.csv', index=False)